In [4]:
import pandas as pd
import numpy as np

float_data = pd.Series([1.2, -3.5, np.nan, 0])
float_data

0    1.2
1   -3.5
2    NaN
3    0.0
dtype: float64

In [5]:
float_data.isna()

0    False
1    False
2     True
3    False
dtype: bool

In [6]:
string_data = pd.Series(['aardvak', 'artichoke', np.nan, 'avocado'])
string_data

0      aardvak
1    artichoke
2          NaN
3      avocado
dtype: object

In [7]:
data = pd.Series([1, np.nan, 3.5, np.nan, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [8]:
data[data.notnull()] #dropna와 동일한 결과

0    1.0
2    3.5
4    7.0
dtype: float64

In [9]:
data[data.notna()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [10]:
# 이제 NA가 아니고 np.nan으로 해야함.

#DataFRame 객체의 경우 좀 복잡하다. 
data = pd.DataFrame([[1., 6.5, 3.], [1., np.nan, np.nan],
                   [np.nan, np.nan, np.nan], [np.nan, 6.5, 3.]])

cleaned = data.dropna()
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [11]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [14]:
data[4] = np.nan
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [16]:
data[0] # 컬럼
data.iloc[0] # row

0    1.0
1    6.5
2    3.0
4    NaN
Name: 0, dtype: float64

In [25]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [31]:
df = pd.DataFrame(np.random.randn(7,3))
df.iloc[:4,1] = np.nan
df.iloc[:2,2] = np.nan
df

          0         1         2
0  0.543456       NaN       NaN
1  0.426957       NaN       NaN
2 -0.041789       NaN  0.992179
3 -0.051043       NaN  0.314713
4 -0.019630  1.064080  0.252891
5 -0.038170  0.812154  0.670351
6 -1.155530  0.512336  0.265591

In [32]:
df.dropna()

         0         1         2
4 -0.01963  1.064080  0.252891
5 -0.03817  0.812154  0.670351
6 -1.15553  0.512336  0.265591

In [33]:
df.dropna(thresh=2)

          0         1         2
2 -0.041789       NaN  0.992179
3 -0.051043       NaN  0.314713
4 -0.019630  1.064080  0.252891
5 -0.038170  0.812154  0.670351
6 -1.155530  0.512336  0.265591

In [38]:
df.dropna(axis='columns',thresh=2) # axis=1보단 axis='columns'

          0         1         2
0  0.543456       NaN       NaN
1  0.426957       NaN       NaN
2 -0.041789       NaN  0.992179
3 -0.051043       NaN  0.314713
4 -0.019630  1.064080  0.252891
5 -0.038170  0.812154  0.670351
6 -1.155530  0.512336  0.265591

In [39]:
df

          0         1         2
0  0.543456       NaN       NaN
1  0.426957       NaN       NaN
2 -0.041789       NaN  0.992179
3 -0.051043       NaN  0.314713
4 -0.019630  1.064080  0.252891
5 -0.038170  0.812154  0.670351
6 -1.155530  0.512336  0.265591

In [41]:
df.fillna(0)

          0         1         2
0  0.543456  0.000000  0.000000
1  0.426957  0.000000  0.000000
2 -0.041789  0.000000  0.992179
3 -0.051043  0.000000  0.314713
4 -0.019630  1.064080  0.252891
5 -0.038170  0.812154  0.670351
6 -1.155530  0.512336  0.265591

In [42]:
df.fillna({1:0.5,2:0})

          0         1         2
0  0.543456  0.500000  0.000000
1  0.426957  0.500000  0.000000
2 -0.041789  0.500000  0.992179
3 -0.051043  0.500000  0.314713
4 -0.019630  1.064080  0.252891
5 -0.038170  0.812154  0.670351
6 -1.155530  0.512336  0.265591

In [43]:
df

          0         1         2
0  0.543456       NaN       NaN
1  0.426957       NaN       NaN
2 -0.041789       NaN  0.992179
3 -0.051043       NaN  0.314713
4 -0.019630  1.064080  0.252891
5 -0.038170  0.812154  0.670351
6 -1.155530  0.512336  0.265591

In [47]:
# df를 바꾸고 싶으면 inplace=True를 쓰세요.

df.fillna(0, inplace=True)
df

          0         1         2
0  0.543456  0.000000  0.000000
1  0.426957  0.000000  0.000000
2 -0.041789  0.000000  0.992179
3 -0.051043  0.000000  0.314713
4 -0.019630  1.064080  0.252891
5 -0.038170  0.812154  0.670351
6 -1.155530  0.512336  0.265591

In [55]:
obj = pd.Series(['blue', 'purple', 'yellow'], index=[0,2,4])
obj

0      blue
2    purple
4    yellow
dtype: object

In [54]:
obj.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [59]:
df = pd.DataFrame(np.random.randn(6,3))
df.iloc[2:, 1] = np.nan
df.iloc[4:, 2] = np.nan
df

          0         1         2
0 -0.091610 -0.579035 -0.645842
1 -0.033293 -0.297661  0.353676
2  1.502927       NaN  0.320430
3  0.687509       NaN -0.228384
4  1.056230       NaN       NaN
5 -0.698527       NaN       NaN

In [61]:
df.fillna(method='ffill')

          0         1         2
0 -0.091610 -0.579035 -0.645842
1 -0.033293 -0.297661  0.353676
2  1.502927 -0.297661  0.320430
3  0.687509 -0.297661 -0.228384
4  1.056230 -0.297661 -0.228384
5 -0.698527 -0.297661 -0.228384

In [62]:
df.fillna(method='bfill')

          0         1         2
0 -0.091610 -0.579035 -0.645842
1 -0.033293 -0.297661  0.353676
2  1.502927       NaN  0.320430
3  0.687509       NaN -0.228384
4  1.056230       NaN       NaN
5 -0.698527       NaN       NaN

In [64]:
df.fillna(method='ffill',limit=2) #두 nan만 채워라.

          0         1         2
0 -0.091610 -0.579035 -0.645842
1 -0.033293 -0.297661  0.353676
2  1.502927 -0.297661  0.320430
3  0.687509 -0.297661 -0.228384
4  1.056230       NaN -0.228384
5 -0.698527       NaN -0.228384

In [65]:
data = pd.Series([1.,np.nan,3.5,np.nan,7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [66]:
data.fillna(data.mean()) # nan을 평균값으로 채우기.

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [67]:
df.fillna(data.mean()) # nan을 평균값으로 채우기.

          0         1         2
0 -0.091610 -0.579035 -0.645842
1 -0.033293 -0.297661  0.353676
2  1.502927  3.833333  0.320430
3  0.687509  3.833333 -0.228384
4  1.056230  3.833333  3.833333
5 -0.698527  3.833333  3.833333

# 데이터 변형

## 중복 제거하기

In [68]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                    'k2': [1,1,2,3,3,4,4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [69]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [70]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [72]:
data['v1'] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [73]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [74]:
#duplicated와 drop_duplicates는 기본적으로 처음 발견된 값을 유지한다. 
#keep='last'옵션을 넘기면 마지막으로 발견된 값을 반환한다.
#data.drop_duplicates(['k1', 'k2'])
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [75]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                             'Pastrami', 'corned beef', 'Bacon',
                            'pastrami', 'honey ham', 'nova lox'],
                    'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [76]:
#해당 육류가 어떤 동물의 고기인지 알려주는 컬럼을 추가한다고 가정하자.
meat_to_animal = {
    'bacon': 'pig',
    'pulled pork': 'pig',
    'pastrami': 'cow',
    'corned beef': 'cow',
    'honey ham': 'pig',
    'nova lox': 'salmon'
}

In [77]:
lowercased = data['food'].str.lower() #데이터에 대소문자 섞여있으므로, 소문자로 변경
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [79]:
data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [80]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

### 값 치환하기

In [86]:
data = pd.Series([1., -999., 2., -999., 3.])
data

0      1.0
1   -999.0
2      2.0
3   -999.0
4      3.0
dtype: float64

In [87]:
data.replace(-999,np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    3.0
dtype: float64

In [88]:
data.replace([-999, 1.0], np.nan)

0    NaN
1    NaN
2    2.0
3    NaN
4    3.0
dtype: float64

In [89]:
data.replace([-999,1.0], [np.nan,0])

0    0.0
1    NaN
2    2.0
3    NaN
4    3.0
dtype: float64

In [91]:
data.replace({-999: np.nan, -1000: 0}) 
#리스트 대신 사전을 사용하는 것도 가능하다

0    1.0
1    NaN
2    2.0
3    NaN
4    3.0
dtype: float64

## 축 색인 이름 바꾸기

In [93]:
data = pd.DataFrame(np.arange(12).reshape((3,4)),
                   index = ['Ohio', 'Colorado', 'New York'],
                   columns = ['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [94]:
transform = lambda x: x[:4].upper()

data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [95]:
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [96]:
data.rename(index=str.title, columns=str.upper) #원래 객체를 변경하지 않고 새로운 객체를 생성하려면 rename 메소드를 사용한다.
#Series.str.lower : Converts all characters to lowercase.
#Series.str.upper : Converts all characters to uppercase.
#Series.str.title : Converts first character of each word to uppercase and remaining to lowercase.
#Series.str.capitalize :Converts first character to uppercase and remaining to lowercase.
#Series.str.swapcase :Converts uppercase to lowercase and lowercase to uppercase.

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [97]:
data.rename(index={'OHIO':"INDIANA"},
           columns = {'three':'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [98]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

# 24.03.27